INSERT INTO kpi_detail (
    kpi_id, goal_id,
    kpi_metric_name,
    kpi_start_value, kpi_target_value,
    is_deleted,
    created_at, updated_at, created_by, updated_by
) VALUES
      -- 팀 KPI (goal 201)
      (1001, 201, '분기 예산 집행률', 0, 100, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1),

      -- 개인 KPI (goal 203)
      (1002, 203, '예산 집행 완료 건수', 0, 50, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1),

      -- 개인 KPI (goal 204)
      (1003, 204, '계약 처리 완료 건수', 0, 40, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1),

      -- 개인 KPI (goal 205)
      (1004, 205, '비용 절감 실행 건수', 0, 30, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1),

      -- 팀 KPI (goal 208)
      (1005, 208, '운영 비용 절감률', 0, 15, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1),

      -- 개인 KPI (goal 209)
      (1006, 209, '비용 절감 분석 리포트 제출 수', 0, 10, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1),

      -- 개인 KPI (goal 210)
      (1007, 210, '재협상 완료 계약 수', 0, 8, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1),

      -- 개인 KPI (goal 211)
      (1008, 211, '불필요 지출 제거 건수', 0, 12, 'N',
       '2026-01-01 09:00:00', '2026-01-01 09:00:00', 1, 1);


INSERT INTO kpi_progress_log (
    kpi_log_id, kpi_id,
    log_date, log_owner_id,
    log_value,
    is_deleted,
    created_at, updated_at, created_by, updated_by
) VALUES
      -- 개인 KPI 1002 (goal 203)
      (1, 1002, '2026-03-31', 1007, 40, 'N',
       '2026-03-31 18:00:00', '2026-03-31 18:00:00', 1, 1),

      -- 개인 KPI 1003 (goal 204)
      (2, 1003, '2026-03-31', 1007, 30, 'N',
       '2026-03-31 18:00:00', '2026-03-31 18:00:00', 1, 1),

      -- 개인 KPI 1004 (goal 205)
      (3, 1004, '2026-03-31', 1007, 20, 'N',
       '2026-03-31 18:00:00', '2026-03-31 18:00:00', 1, 1);
INSERT INTO kpi_progress_log (
    kpi_log_id, kpi_id,
    log_date, log_owner_id,
    log_value,
    is_deleted,
    created_at, updated_at, created_by, updated_by
) VALUES
      (4, 1006, '2026-03-31', 1005, 8, 'N',
       '2026-03-31 18:00:00', '2026-03-31 18:00:00', 1, 1),

      (5, 1007, '2026-03-31', 1006, 6, 'N',
       '2026-03-31 18:00:00', '2026-03-31 18:00:00', 1, 1),

      (6, 1008, '2026-03-31', 1008, 10, 'N',
       '2026-03-31 18:00:00', '2026-03-31 18:00:00', 1, 1);
